In [5]:
import pandas as pd
import numpy as np

# Question 1
What's the version of NumPy that you installed?

You can get the version information using the __version__ field:

In [6]:
np.__version__

'1.23.0'

In [8]:
# read in the Car price dataset
df = pd.read_csv('data.csv')

# Question 2
How many records are in the dataset?

Here you need to specify the number of rows.

* 16
* 6572
* 11914
* 18990

In [11]:
df.shape[0]

11914

# Question 3
* Who are the most frequent car manufacturers (top-3) according to the dataset?
* Chevrolet, Volkswagen, Toyota
* Chevrolet, Ford, Toyota
* Ford, Volkswagen, Toyota
* Chevrolet, Ford, Volkswagen

In [40]:
df['Make'].value_counts().head(3)

Chevrolet     1123
Ford           881
Volkswagen     809
Name: Make, dtype: int64

# Question 4
What's the number of unique Audi car models in the dataset?

* 3
* 16
* 26
* 34

In [107]:
Audi_df = df[ df['Make'] == 'Audi']

Audi_df.nunique()

Make                   1
Model                 34
Year                  20
Engine Fuel Type       5
Engine HP             40
Engine Cylinders       6
Transmission Type      3
Driven_Wheels          2
Number of Doors        2
Market Category       15
Vehicle Size           3
Vehicle Style          6
highway MPG           23
city mpg              18
Popularity             1
MSRP                 234
dtype: int64

# Question 5
How many columns in the dataset have missing values?

* 5
* 6
* 7
* 8

* Anwser is 5

In [36]:
df.isnull().sum()

Make                    0
Model                   0
Year                    0
Engine Fuel Type        3
Engine HP              69
Engine Cylinders       30
Transmission Type       0
Driven_Wheels           0
Number of Doors         6
Market Category      3742
Vehicle Size            0
Vehicle Style           0
highway MPG             0
city mpg                0
Popularity              0
MSRP                    0
dtype: int64

# Question 6
* Find the median value of "Engine Cylinders" column in the dataset.
* Next, calculate the most frequent value of the same "Engine Cylinders".
* Use the fillna method to fill the missing values in "Engine Cylinders" with the most frequent value from the previous step.
* Now, calculate the median value of "Engine Cylinders" once again.

In [41]:
# Median Value
df['Engine Cylinders'].median()

6.0

In [50]:
# Calculate the most freq value
df['Engine Cylinders'].mode()

0    4.0
Name: Engine Cylinders, dtype: float64

In [52]:
# Use fillna with freq val
df['Engine Cylinders'] = df['Engine Cylinders'].fillna(4.0)

In [53]:
# Calculate the median val of "Engine Cylinders"
df['Engine Cylinders'].median()

6.0

# Has it changed?

## Answer: No

# Question 7
* Select all the "Lotus" cars from the dataset.
* Select only columns "Engine HP", "Engine Cylinders".
* Now drop all duplicated rows using drop_duplicates method (you should get a dataframe with 9 rows).
* Get the underlying NumPy array. Let's call it X.
* Compute matrix-matrix multiplication between the transpose of X and X. To get the transpose, use X.T. Let's call the result XTX.
* Invert XTX.
* Create an array y with values [1100, 800, 750, 850, 1300, 1000, 1000, 1300, 800].
* Multiply the inverse of XTX with the transpose of X, and then multiply the result by y. Call the result w.
* What's the value of the first element of w?

In [60]:
# Select all lotus cars
lotus_df = df[ df['Make'] == 'Lotus' ]

In [62]:
# Select only columns "Engine HP", "Engine Cylinders"
lotus_df[['Engine HP', 'Engine Cylinders']]

      Engine HP  Engine Cylinders
3912      189.0               4.0
3913      218.0               4.0
3914      189.0               4.0
3915      189.0               4.0
3916      218.0               4.0
3917      189.0               4.0
3918      217.0               4.0
3919      217.0               4.0
4216      350.0               8.0
4217      350.0               8.0
4218      350.0               8.0
4257      400.0               6.0
4258      400.0               6.0
4259      276.0               6.0
4260      276.0               6.0
4261      276.0               6.0
4262      345.0               6.0
4263      345.0               6.0
4264      276.0               6.0
4265      345.0               6.0
4266      276.0               6.0
4267      345.0               6.0
4268      276.0               6.0
4292      257.0               4.0
4293      240.0               4.0
4294      240.0               4.0
4295      240.0               4.0
4296      257.0               4.0
4297      257.0               4.0

In [67]:
# Drop drows with duplicate values 
new_lotus_df = lotus_df[['Engine HP', 'Engine Cylinders']].drop_duplicates()
new_lotus_df

      Engine HP  Engine Cylinders
3912      189.0               4.0
3913      218.0               4.0
3918      217.0               4.0
4216      350.0               8.0
4257      400.0               6.0
4259      276.0               6.0
4262      345.0               6.0
4292      257.0               4.0
4293      240.0               4.0

In [70]:
# Convert to numpy array
X = np.array(new_lotus_df)
X

array([[189.,   4.],
       [218.,   4.],
       [217.,   4.],
       [350.,   8.],
       [400.,   6.],
       [276.,   6.],
       [345.,   6.],
       [257.,   4.],
       [240.,   4.]])

In [77]:
def vector_vector_multiplication(u , v):
    # check to each matrix is the same size 
    assert u.shape[0] == v.shape[0]

    n = u.shape[0]
    result = 0.0
    for i  in range(n):
        result = result +  u[i] * v[i]
    return result

In [75]:
def matrix_vector_multiplication(U,v):
    assert U.shape[1] == v.shape[0]
    
    num_rows = U.shape[0]

    result = np.zeros(num_rows)

    for i in range(num_rows):
        result [i] = vector_vector_multiplication(U[i], v)
    return result

In [73]:
def matrix_matrix_multiplication(U, V):
    assert U.shape[1] == V.shape[0]

    num_rows = U.shape[0]
    num_cols = V.shape[1]

    result = np.zeros((num_rows, num_cols))

    for i in range(num_cols):
        vi = V[:, i]
        Uvi = matrix_vector_multiplication(U, vi)

        result[:, i] = Uvi

    return result

In [90]:
# Computer matrix-matrix multiplication 
x_transpose = X.T

# XTX = matrix_matrix_multiplication(x_transpose, X)
# XTX

test = X.T.dot(X)
test

array([[7.31684e+05, 1.34100e+04],
       [1.34100e+04, 2.52000e+02]])

In [91]:
# invert XTX

inv_XTX = np.linalg.inv(XTX)
inv_XTX.sum()

0.1547573584345781

In [82]:
# Create y array with values [1100, 800, 750, 850, 1300, 1000, 1000, 1300, 800]

y = [1100, 800, 750, 850, 1300, 1000, 1000, 1300, 800]

In [96]:
# whats the value of the first element of w
w = inv_XTX.dot(x_transpose).dot(y)
w[0]

4.594944810094551